MLPModel(
  (mlp): Sequential(
    (0): Sequential(
      (0): Linear(in_features=42, out_features=128, bias=True)
      (1): ReLU(inplace=True)
    )
    (1): Sequential(
      (0): Linear(in_features=128, out_features=28, bias=True)
      (1): ReLU(inplace=True)
    )
  )
  (output_layer): Linear(in_features=28, out_features=28, bias=True)
)